Documents/СписаниеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыданноСоСклада</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСписанияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСписанияМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучноеДобавление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ВыданноСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыданноСоСклада</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСписанияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСписанияМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СписаниеМатериалов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПустойКомплект  = Справочники.ИзделияКомплект.ПустаяСсылка();
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
		              |	ОстаткиТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
		              |	ОстаткиТоваровНаСкладахОстатки.Склад КАК Склад,
		              |	ОстаткиТоваровНаСкладахОстатки.КоличествоОстаток КАК Количество,
		              |	ОстаткиТоваровНаСкладахОстатки.СуммаСНДСОстаток КАК СуммаСНДС
		              |ИЗ
		              |	РегистрНакопления.ОстаткиТоваровНаСкладах.Остатки(&Дата, Номенклатура В (&МассивМатериалы)) КАК ОстаткиТоваровНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	Запрос.УстановитьПараметр("МассивМатериалы", Материалы.ВыгрузитьКолонку("Номенклатура"));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	стОтбор = Новый Структура("Номенклатура", );
	
	Движения.ОстаткиТоваровНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл 
		
		стОтбор.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		НайденныеСтроки = ТЗ.НайтиСтроки(стОтбор);
		
		Количество = ТекСтрокаМатериалы.Количество * ТекСтрокаМатериалы.Коэффициент; 
		

		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		    Если НайденнаяСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ОстаткиТоваровНаСкладах.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
			Движение.Период 			= Дата;
			Движение.Склад 				= Склад;
			
			Если НайденнаяСтрока.Количество >= Количество Тогда
				Движение.СуммаСНДС 	= Окр((НайденнаяСтрока.СуммаСНДС / НайденнаяСтрока.Количество) * Количество, 2);
				Движение.Количество = Количество;
				
				НайденнаяСтрока.СуммаСНДС  = НайденнаяСтрока.СуммаСНДС  - Движение.СуммаСНДС;
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Количество;
				Количество = 0;
				Прервать;
			Иначе
				Движение.СуммаСНДС 	= НайденнаяСтрока.СуммаСНДС;
				Движение.Количество = НайденнаяСтрока.Количество;
				
				Количество 			= Количество - НайденнаяСтрока.Количество;
				
				НайденнаяСтрока.Количество = 0;
				НайденнаяСтрока.СуммаСНДС  = 0;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если Количество > 0 Тогда
			Движение = Движения.ОстаткиТоваровНаСкладах.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
			Движение.Период 			= Дата;
			Движение.Склад 				= Склад;
			Движение.Количество			= Количество;
			Движение.СуммаСНДС			= 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать(); 
	
	
	СуммаДокумента = Движения.ОстаткиТоваровНаСкладах.Итог("СуммаСНДС");
	
	Сделка 	= ?(ЗначениеЗаполнено(ИзделиеКомплект), ИзделиеКомплект.Проект, Справочники.Проекты.ПустаяСсылка());
	
	тзТЧ = Материалы.ВыгрузитьКолонки("Количество, Номенклатура"); 
	тзТЧ.Свернуть("Номенклатура", "Количество");
	
	Движения.ВыданноСоСклада.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из тзТЧ Цикл
		Движение = Движения.ВыданноСоСклада.Добавить();
		Движение.Проект 					= Сделка;
		Движение.ИзделиеКомплект 			= ИзделиеКомплект;
		Движение.Количество 				= ТекСтрокаМатериалы.Количество;
		Движение.Номенклатура 				= ТекСтрокаМатериалы.Номенклатура;
		Движение.СтатусСписанияМатериалов 	= СтатусСписанияМатериалов;
	КонецЦикла;


	
КонецПроцедуры  


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мМатериалы = Новый Массив;
	
	Для каждого текМатериал Из Материалы Цикл
		Если НЕ текМатериал.РучноеДобавление И мМатериалы.Найти(текМатериал.Номенклатура) = Неопределено Тогда
			мМатериалы.Добавить(текМатериал.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ мМатериалы.Количество() = 0 Тогда
		мЦены = ОбщегоНазначения.ТаблицаЗначенийВМассив(омЦеныНаСервере.ПолучитьСебестоимостьМатериалов(мМатериалы, Склад, Новый МоментВремени(Дата,Ссылка)));
		
		стОтбор = Новый Структура("РучноеДобавление,Номенклатура",Ложь, );
		Для каждого текЦена Из мЦены Цикл
			стОтбор.Номенклатура = текЦена.Номенклатура;
			
			Для каждого текМатериал Из Материалы.НайтиСтроки(стОтбор) Цикл
				Если текМатериал.Коэффициент = 0 Тогда
					Продолжить;
				КонецЕсли;	
				
				текМатериал.Цена 	= текЦена.Цена * текМатериал.Коэффициент;
				текМатериал.Сумма 	= текМатериал.Цена * текМатериал.Количество;
				
			КонецЦикла;     	
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
